# ── Taps ──
tap "domt4/autoupdate"

# ── Terminal & Shell ──
brew "zsh"
brew "zsh-syntax-highlighting"
brew "zsh-completions"
brew "zoxide"
brew "fzf"
brew "ripgrep"
brew "chroma"
brew "starship"
brew "neovim"
brew "tmux"

# ── CLI Tools ──
brew "jq"
brew "bind"
brew "helm"
brew "viddy"
brew "bitwarden-cli"
brew "uv"
brew "ccat"
brew "gh"
brew "atuin"
brew "golangci-lint"
brew "gitleaks"
brew "chezmoi"
brew "pinentry-mac"

# ── Container & Version Manager ──
brew "colima"
brew "mise"
brew "terraform-docs"
brew "awscli"

# ── Fonts ──
cask "font-maple-mono-nf-cn"

# ── Terminal ──
cask "ghostty"

# ── Apps ──
cask "squirrel-app"
cask "arc"
cask "visual-studio-code"
cask "obsidian"
cask "bitwarden"
cask "mos"
cask "spotify"
cask "claude"
